fixtures/vcr_cassettes/stripe_capture_intent.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents/pi_3QUVXeFWpgsj4fDK05NxCc94/capture
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/13.3.1
      Authorization:
      - Bearer <stripe_secret>
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_4hYFVzbOoPW0Wq","request_duration_ms":2}}'
      Idempotency-Key:
      - 8b0f683e-502d-4a18-91a7-008aacadd8e4
      Stripe-Version:
      - 2024-12-18.acacia
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"13.3.1","lang":"ruby","lang_version":"3.2.3 p157 (2024-01-18)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 5.15.167.4-microsoft-standard-WSL2 (root@f9c826d3017f) (gcc (GCC)
        11.2.0, GNU ld (GNU Binutils) 2.37) #1 SMP Tue Nov 5 00:21:55 UTC 2024","hostname":"DESKTOP-SBP666L"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: Ok
    headers:
      Server:
      - nginx
      Date:
      - Mon, 03 Mar 2025 17:29:47 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2629'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=OPd5D9H0JAMQlKl6-zUcMV3I3tcqit0iSeE9USa2nkPV0wADzjeQT7FRW7OgYGXUu1Im98nt6cNbsN1H
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Idempotency-Key:
      - 8b0f683e-502d-4a18-91a7-008aacadd8e4
      Original-Request:
      - req_ziPYKxKGmxlOqH
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report"
      Request-Id:
      - req_ziPYKxKGmxlOqH
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - 2024-12-18.acacia
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - AB
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "code": "payment_intent_unexpected_state",
            "doc_url": "https://stripe.com/docs/error-codes/payment-intent-unexpected-state",
            "message": "This PaymentIntent could not be captured because it has a status of requires_confirmation. Only a PaymentIntent with one of the following statuses may be captured: requires_capture.",
            "payment_intent": {
              "id": "pi_3QUVXeFWpgsj4fDK05NxCc94",
              "object": "payment_intent",
              "amount": 1998,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {
                }
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": {
                "allow_redirects": "always",
                "enabled": true
              },
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "automatic_async",
              "client_secret": "pi_3QUVXeFWpgsj4fDK05NxCc94_secret_sl8a0nX9wXubwCWAzEsldI7Tw",
              "confirmation_method": "automatic",
              "created": 1733845206,
              "currency": "gbp",
              "customer": null,
              "description": null,
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": null,
              "livemode": false,
              "metadata": {
              },
              "next_action": null,
              "on_behalf_of": null,
              "payment_method": "pm_1QycnNFWpgsj4fDKlNlhPukY",
              "payment_method_configuration_details": {
                "id": "pmc_1QUVA6FWpgsj4fDKbxDqhxKv",
                "parent": null
              },
              "payment_method_options": {
                "afterpay_clearpay": {
                  "reference": null
                },
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                },
                "klarna": {
                  "preferred_locale": null
                },
                "link": {
                  "persistent_token": null
                },
                "paypal": {
                  "preferred_locale": null,
                  "reference": null
                }
              },
              "payment_method_types": [
                "card",
                "afterpay_clearpay",
                "klarna",
                "link",
                "paypal"
              ],
              "processing": null,
              "receipt_email": "rolland_glover@monahan.test",
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_confirmation",
              "transfer_data": null,
              "transfer_group": null
            },
            "request_log_url": "https://dashboard.stripe.com/test/logs/req_ziPYKxKGmxlOqH?t=1741022986",
            "type": "invalid_request_error"
          }
        }
  recorded_at: Mon, 03 Mar 2025 17:29:46 GMT
recorded_with: VCR 6.3.1
